voltvirtuoso/SerialInterfaceHandler/src/ESP8266_SIH.cpp
/**
 * @file ESP8266_SIH.cpp
 * @brief ESP8266 Serial Interface Handler - Core Implementation
 * 
 * This implementation file contains all method definitions for the ESP8266_SIH
 * system classes. It provides the complete functionality for WiFi management,
 * EEPROM storage operations, serial interface handling, menu system navigation,
 * and system monitoring.
 * 
 * @author ESP8266_SIH Development Team
 * @version 1.0.0
 * @date December 2025
 * 
 * @copyright MIT License
 */
#include "ESP8266_SIH.h"

// WiFiScanResult implementation
bool WiFiScanResult::isOpen() const {
    return encryptionType == ENC_TYPE_NONE;
}

// NetworkCredential implementation
NetworkCredential::NetworkCredential() {
    memset(ssid, 0, sizeof(ssid));
    memset(password, 0, sizeof(password));
    isValid = false;
    lastConnected = 0;
    connectionAttempts = 0;
    successfulConnections = 0;
}

void NetworkCredential::set(const String& ssidStr, const String& passwordStr) {
    ssidStr.toCharArray(ssid, SSID_MAX_LENGTH + 1);
    passwordStr.toCharArray(password, PASSWORD_MAX_LENGTH + 1);
    isValid = true;
}

String NetworkCredential::getSSID() const {
    return String(ssid);
}

String NetworkCredential::getPassword() const {
    return String(password);
}

// EEPROMStorage implementation
EEPROMStorage::EEPROMStorage() : _initialized(false) {}

void EEPROMStorage::loadHeader() {
    EEPROM.get(HEADER_ADDR, _header);
    if (_header.magic != EEPROM_MAGIC) {
        // Initialize new EEPROM structure
        _header.magic = EEPROM_MAGIC;
        _header.networkCount = 0;
        _header.reserved = 0;
        saveHeader();
    }
}

void EEPROMStorage::saveHeader() {
    EEPROM.put(HEADER_ADDR, _header);
    EEPROM.commit();
}

void EEPROMStorage::loadNetworks() {
    uint16_t addr = NETWORKS_ADDR;
    for (uint8_t i = 0; i < _header.networkCount && i < MAX_NETWORKS; i++) {
        EEPROM.get(addr, _networks[i]);
        addr += sizeof(NetworkCredential);
    }
}

void EEPROMStorage::saveNetworks() {
    uint16_t addr = NETWORKS_ADDR;
    for (uint8_t i = 0; i < _header.networkCount && i < MAX_NETWORKS; i++) {
        EEPROM.put(addr, _networks[i]);
        addr += sizeof(NetworkCredential);
    }
    EEPROM.commit();
}

bool EEPROMStorage::begin() {
    if (_initialized) return true;
    
    EEPROM.begin(EEPROM_SIZE);
    loadHeader();
    loadNetworks();
    _initialized = true;
    return true;
}

int EEPROMStorage::findNetworkIndex(const String& ssid) const {
    for (uint8_t i = 0; i < _header.networkCount; i++) {
        if (_networks[i].isValid && ssid.equals(_networks[i].getSSID())) {
            return i;
        }
    }
    return -1;
}

void EEPROMStorage::removeLeastSuccessfulNetwork() {
    if (_header.networkCount == 0) return;
    
    uint8_t leastSuccessfulIndex = 0;
    uint32_t minSuccess = _networks[0].successfulConnections;
    
    for (uint8_t i = 1; i < _header.networkCount; i++) {
        if (_networks[i].successfulConnections < minSuccess) {
            minSuccess = _networks[i].successfulConnections;
            leastSuccessfulIndex = i;
        }
    }
    
    // Shift remaining networks down
    for (uint8_t i = leastSuccessfulIndex; i < _header.networkCount - 1; i++) {
        _networks[i] = _networks[i + 1];
    }
    
    _header.networkCount--;
    memset(&_networks[_header.networkCount], 0, sizeof(NetworkCredential));
}

bool EEPROMStorage::saveNetwork(const String& ssid, const String& password) {
    if (!_initialized) return false;
    
    // Check if network already exists
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        // Update existing network
        _networks[index].set(ssid, password);
        _networks[index].connectionAttempts = 0;
        _networks[index].successfulConnections++;
        _networks[index].lastConnected = millis();
    } else {
        // Add new network
        if (_header.networkCount >= MAX_NETWORKS) {
            // Remove least successful network
            removeLeastSuccessfulNetwork();
        }
        
        index = _header.networkCount++;
        _networks[index].set(ssid, password);
        _networks[index].connectionAttempts = 0;
        _networks[index].successfulConnections = 1;
        _networks[index].lastConnected = millis();
    }
    
    saveNetworks();
    saveHeader();
    return true;
}

bool EEPROMStorage::getNetwork(const String& ssid, NetworkCredential& credential) {
    if (!_initialized) return false;
    
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        credential = _networks[index];
        return true;
    }
    return false;
}

bool EEPROMStorage::removeNetwork(const String& ssid) {
    if (!_initialized) return false;
    
    int index = findNetworkIndex(ssid);
    if (index < 0) return false;
    
    // Shift remaining networks down
    for (uint8_t i = index; i < _header.networkCount - 1; i++) {
        _networks[i] = _networks[i + 1];
    }
    
    _header.networkCount--;
    memset(&_networks[_header.networkCount], 0, sizeof(NetworkCredential));
    
    saveNetworks();
    saveHeader();
    return true;
}

void EEPROMStorage::clearAllNetworks() {
    if (!_initialized) return;
    
    _header.networkCount = 0;
    memset(_networks, 0, sizeof(_networks));
    
    saveNetworks();
    saveHeader();
}

std::vector<NetworkCredential> EEPROMStorage::getAllNetworks() const {
    std::vector<NetworkCredential> result;
    for (uint8_t i = 0; i < _header.networkCount; i++) {
        if (_networks[i].isValid) {
            result.push_back(_networks[i]);
        }
    }
    return result;
}

size_t EEPROMStorage::getNetworkCount() const {
    return _header.networkCount;
}

void EEPROMStorage::incrementConnectionAttempts(const String& ssid) {
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        _networks[index].connectionAttempts++;
        _networks[index].lastConnected = millis();
        saveNetworks();
    }
}

void EEPROMStorage::markConnectionSuccessful(const String& ssid) {
    int index = findNetworkIndex(ssid);
    if (index >= 0) {
        _networks[index].successfulConnections++;
        _networks[index].lastConnected = millis();
        saveNetworks();
    }
}

