voltvirtuoso/SerialInterfaceHandler/src/ESP8266_SIH.cpp
// CommandHandler Implementation
bool CommandHandler::registerCommand(const String& command, 
                                   CommandCallback callback,
                                   const String& description,
                                   const String& usage,
                                   const String& category) {
    CommandInfo info{description, usage, category};
    _commands[command] = std::make_pair(callback, info);
    return true;
}

bool CommandHandler::executeCommand(const String& commandLine) {
    if (commandLine.isEmpty()) return false;
    
    std::vector<String> args;
    int start = 0;
    int end = commandLine.indexOf(' ');
    
    while (end != -1) {
        String arg = commandLine.substring(start, end);
        if (arg.length() > 0) args.push_back(arg);
        start = end + 1;
        end = commandLine.indexOf(' ', start);
    }
    String lastArg = commandLine.substring(start);
    if (lastArg.length() > 0) args.push_back(lastArg);
    
    if (args.empty()) return false;
    
    String command = args[0];
    args.erase(args.begin());
    
    auto it = _commands.find(command);
    if (it != _commands.end()) {
        it->second.first(args);
        return true;
    }
    
    Serial.printf("Unknown command: %s\n", command.c_str());
    Serial.println("Type 'help' for available commands");
    return false;
}

String CommandHandler::getCommandHelp(const String& command) const {
    auto it = _commands.find(command);
    if (it != _commands.end()) {
        const auto& info = it->second.second;
        String help = "Command: " + command + "\n";
        help += "Description: " + info.description + "\n";
        help += "Usage: " + info.usage + "\n";
        help += "Category: " + info.category + "\n";
        return help;
    }
    return "";
}

std::vector<String> CommandHandler::getCategories() const {
    std::vector<String> categories;
    for (const auto& pair : _commands) {
        const String& category = pair.second.second.category;
        bool found = false;
        for (const auto& existing : categories) {
            if (existing == category) {
                found = true;
                break;
            }
        }
        if (!found) {
            categories.push_back(category);
        }
    }
    return categories;
}

std::vector<String> CommandHandler::getAvailableCommands(const String& category) const {
    std::vector<String> commands;
    for (const auto& pair : _commands) {
        if (category.isEmpty() || pair.second.second.category == category) {
            commands.push_back(pair.first);
        }
    }
    return commands;
}

// HelpSystem Implementation
HelpSystem::HelpSystem(CommandHandler* commandHandler, HardwareSerial* serial)
    : _commandHandler(commandHandler), _serial(serial) {}

void HelpSystem::showHelp(const String& command) {
    if (command.isEmpty()) {
        _serial->println("\n=== ESP8266 Serial Interface System Help ===");
        _serial->println("Available commands:");
        
        auto categories = getHelpCategories();
        for (const auto& category : categories) {
            _serial->printf("\n--- %s Commands ---\n", category.c_str());
            auto commands = _commandHandler->getAvailableCommands(category);
            for (const auto& cmd : commands) {
                String help = _commandHandler->getCommandHelp(cmd);
                if (!help.isEmpty()) {
                    _serial->println(help.substring(0, help.indexOf('\n')));
                }
            }
        }
        
        _serial->println("\nUsage:");
        _serial->println("  help <command>    - Show help for specific command");
        _serial->println("  help <category>   - Show commands in category");
        _serial->println("  ?                 - Quick help summary");
        _serial->println("  menu              - Access interactive menus");
        _serial->println("  status            - Show system status");
    } else {
        String help = _commandHandler->getCommandHelp(command);
        if (!help.isEmpty()) {
            _serial->println("\n=== Command Help: " + command + " ===");
            _serial->println(help);
            return;
        }
        
        auto categories = getHelpCategories();
        for (const auto& category : categories) {
            if (category.equalsIgnoreCase(command)) {
                showCategoryHelp(command);
                return;
            }
        }
        
        _serial->println("Command or category not found: " + command);
        _serial->println("Type 'help' for list of available commands and categories");
    }
}

void HelpSystem::showQuickHelp() {
    _serial->println("\n=== Quick Help Summary ===");
    _serial->println("?        - Show this quick help");
    _serial->println("help     - Show detailed help system");
    _serial->println("menu     - Access configuration menus");
    _serial->println("status   - Show system status");
    _serial->println("wifi     - WiFi management commands");
    _serial->println("creds    - Manage stored credentials");
}

void HelpSystem::showCategoryHelp(const String& category) {
    _serial->println("\n=== Help Category: " + category + " ===");
    
    auto commands = _commandHandler->getAvailableCommands(category);
    if (commands.empty()) {
        _serial->println("No commands found in category: " + category);
        return;
    }
    
    for (const auto& cmd : commands) {
        String help = _commandHandler->getCommandHelp(cmd);
        if (!help.isEmpty()) {
            _serial->println(help);
        }
    }
}

std::vector<String> HelpSystem::getHelpCategories() const {
    return _commandHandler->getCategories();
}

// WiFiManager Implementation
void WiFiManager::setupWiFi() {
    // Properly initialize WiFi module
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    delay(100);
}

WiFiManager::WiFiManager() : _connected(false), _lastReconnectAttempt(0) {}

bool WiFiManager::begin() {
    if (!_storage.begin()) {
        return false;
    }
    
