voltvirtuoso/SerialInterfaceHandler/src/ESP8266_SIH.cpp
    // Setup WiFi hardware properly
    setupWiFi();
    
    return true;
}

bool WiFiManager::scanNetworks(std::vector<WiFiScanResult>& results) {
    int n = WiFi.scanNetworks();
    
    if (n <= 0) {
        results.clear();
        return n == 0; // true if no networks found, false if scan failed
    }
    
    results.reserve(n);
    for (int i = 0; i < n; i++) {
        WiFiScanResult result;
        result.ssid = WiFi.SSID(i);
        result.rssi = WiFi.RSSI(i);
        result.encryptionType = WiFi.encryptionType(i);
        result.isHidden = false; // ESP8266 doesn't provide this info
        results.push_back(result);
    }
    
    return true;
}

bool WiFiManager::connect(const String& ssid, const String& password, bool saveCredentials) {
    // Ensure WiFi is properly set up
    setupWiFi();
    
    Serial.printf("Attempting to connect to: %s\n", ssid.c_str());
    _storage.incrementConnectionAttempts(ssid);
    
    WiFi.begin(ssid.c_str(), password.c_str());
    
    unsigned long startTime = millis();
    while (millis() - startTime < 15000) { // 15 second timeout
        int status = WiFi.status();
        if (status == WL_CONNECTED) {
            _connected = true;
            _connectedSSID = ssid;
            
            // Only save credentials if connection is successful
            if (saveCredentials) {
                _storage.saveNetwork(ssid, password);
                _storage.markConnectionSuccessful(ssid);
            }
            
            Serial.printf("✓ Connected to %s successfully\n", ssid.c_str());
            Serial.printf("IP Address: %s\n", WiFi.localIP().toString().c_str());
            return true;
        }
        delay(200);
    }
    
    _connected = false;
    Serial.printf("✗ Failed to connect to %s (status: %d)\n", ssid.c_str(), WiFi.status());
    return false;
}

bool WiFiManager::autoConnect() {
    if (!_storage.begin()) {
        Serial.println("EEPROM storage not initialized");
        return false;
    }
    
    auto networks = _storage.getAllNetworks();
    if (networks.empty()) {
        Serial.println("No saved WiFi credentials found");
        return false;
    }
    
    // Sort networks by priority (successful connections, last connected time)
    sortNetworksByPriority(networks);
    
    Serial.println("Attempting auto-connect to stored networks...");
    
    for (const auto& network : networks) {
        if (!network.isValid) continue;
        
        String ssid = network.getSSID();
        String password = network.getPassword();
        
        Serial.printf("Trying network: %s\n", ssid.c_str());
        
        if (connect(ssid, password, false)) {
            return true;
        }
    }
    
    Serial.println("All auto-connect attempts failed");
    return false;
}

void WiFiManager::sortNetworksByPriority(std::vector<NetworkCredential>& networks) {
    std::sort(networks.begin(), networks.end(), 
        [](const NetworkCredential& a, const NetworkCredential& b) {
            // Primary: successful connections
            if (a.successfulConnections != b.successfulConnections) {
                return a.successfulConnections > b.successfulConnections;
            }
            // Secondary: last connected time (more recent first)
            return a.lastConnected > b.lastConnected;
        });
}

bool WiFiManager::verifyConnection() {
    if (!_connected) return false;
    return WiFi.status() == WL_CONNECTED;
}

bool WiFiManager::clearAllCredentials() {
    _storage.clearAllNetworks();
    WiFi.disconnect();
    delay(100);
    _connected = false;
    _connectedSSID = "";
    Serial.println("✓ All WiFi credentials cleared successfully");
    return true;
}

std::vector<NetworkCredential> WiFiManager::listStoredCredentials() const {
    return _storage.getAllNetworks();
}

bool WiFiManager::removeCredential(const String& ssid) {
    return _storage.removeNetwork(ssid);
}

WiFiManager::ConnectionStatus WiFiManager::getStatus() const {
    ConnectionStatus status;
    status.connected = _connected && (WiFi.status() == WL_CONNECTED);
    status.ssid = _connectedSSID;
    status.ip = status.connected ? WiFi.localIP().toString() : "0.0.0.0";
    status.rssi = status.connected ? WiFi.RSSI() : 0;
    return status;
}

bool WiFiManager::isStorageInitialized() {
    return _storage.begin();
}

// v2
bool WiFiManager::enableWiFi() {
    if (WiFi.status() == WL_CONNECTED) {
        return true;
    }
    setupWiFi();
    _connected = false;
    _connectedSSID = "";
    Serial.println("✓ WiFi enabled");
    return true;
}

bool WiFiManager::disableWiFi() {
    if (WiFi.status() != WL_CONNECTED) {
        WiFi.mode(WIFI_OFF);
        _connected = false;
        _connectedSSID = "";
        Serial.println("✓ WiFi disabled");
        return true;
    }
    return disconnect();
}

bool WiFiManager::disconnect() {
    if (!_connected) return true;
    
    WiFi.disconnect();
    delay(100);
    _connected = false;
    _wasConnected = true; // Remember we were connected for auto-reconnect
    _lastDisconnectTime = millis();
    _connectedSSID = "";
    Serial.println("✓ Disconnected from WiFi");
    return true;
}

void WiFiManager::setAutoReconnect(bool enabled) {
    _autoReconnectEnabled = enabled;
    Serial.printf("✓ Auto-reconnect %s\n", enabled ? "enabled" : "disabled");
}

void WiFiManager::setReconnectTimeout(unsigned long timeoutMs) {
    _reconnectTimeout = timeoutMs;
    Serial.printf("✓ Reconnect timeout set to %lu ms\n", timeoutMs);
}

bool WiFiManager::isAutoReconnectEnabled() const {
    return _autoReconnectEnabled;
}

// MenuSystem Implementation
MenuSystem::MenuSystem(HardwareSerial* serial, CommandHandler* commandHandler,
                     WiFiManager* wifiManager)
    : _serial(serial), _commandHandler(commandHandler), 
      _wifiManager(wifiManager), _currentMenu(MAIN), _inMenuMode(false),
      _lastActivity(0), _menuTimeout(60000) {
    initializeMenus();
}

void MenuSystem::initializeMenus() {
    _mainMenuItems = {
        {1, "WiFi Configuration", [this]() { showMenu(WIFI); }, "Configure WiFi networks", true},
        {2, "Credentials Management", [this]() { showMenu(CREDENTIALS); }, "Manage stored networks", true},
        {3, "System Status", [this]() { showSystemStatus(); }, "Show system information", true},
        {4, "Exit Menu", [this]() { exitMenu(); }, "Return to command mode", true}
    };
    
    _wifiMenuItems = {
        {1, "Scan Networks", [this]() { scanNetworks(); }, "Scan for available networks", true},
        {2, "Connect to Network", [this]() { connectToNetwork(); }, "Connect to WiFi network", true},
        {3, "Auto Connect", [this]() { 
            _serial->println("Attempting auto-connect to stored networks...");
            if (_wifiManager->autoConnect()) {
                _serial->println("✓ Auto-connect successful!");
            } else {
                _serial->println("✗ Auto-connect failed");
            }
            delay(2000);
            showMenu(WIFI);
        }, "Auto-connect to stored networks", true},
        {4, "Check Connection", [this]() { checkConnection(); }, "Check current WiFi status", true},
        {5, "Back to Main Menu", [this]() { showMenu(MAIN); }, "Return to main menu", true}
    };
    
    _credentialsMenuItems = {
        {1, "List Stored Networks", [this]() { listStoredCredentials(); }, "Show all stored credentials", true},
        {2, "Remove Network", [this]() { removeStoredCredential(); }, "Remove a specific network", true},
        {3, "Clear All Networks", [this]() { clearAllCredentials(); }, "Clear all stored credentials", true},
        {4, "Back to Main Menu", [this]() { showMenu(MAIN); }, "Return to main menu", true}
    };
}

void MenuSystem::showMenu(MenuType type) {
    _currentMenu = type;
    _inMenuMode = true;
    _lastActivity = millis();
    
    clearScreen();
    showHeader(getMenuTitle(type));
    
    std::vector<MenuItem>* items = nullptr;
    switch (type) {
        case MAIN: items = &_mainMenuItems; break;
        case WIFI: items = &_wifiMenuItems; break;
        case CREDENTIALS: items = &_credentialsMenuItems; break;
        default: items = &_mainMenuItems; break;
    }
    
