voltvirtuoso/SerialInterfaceHandler/src/ESP8266_SIH.cpp
    for (const auto& item : *items) {
        if (item.isEnabled) {
            _serial->printf("%d. %s\n", item.id, item.label.c_str());
            if (!item.description.isEmpty()) {
                _serial->printf("   - %s\n", item.description.c_str());
            }
        }
    }
    
    showFooter();
    _serial->print("\nSelect option (1-" + String(items->size()) + "): ");
}

void MenuSystem::process() {
    if (!_inMenuMode) return;
    
    if (millis() - _lastActivity > _menuTimeout) {
        exitMenu();
        _serial->println("\nMenu timeout. Returned to command mode.");
    }
}

void MenuSystem::handleMenuInput(char inputChar) {
    _lastActivity = millis();
    
    if (inputChar == '0') {
        exitMenu();
        return;
    }
    
    int selection = inputChar - '0';
    if (selection < 1) return;
    
    std::vector<MenuItem>* items = nullptr;
    switch (_currentMenu) {
        case MAIN: items = &_mainMenuItems; break;
        case WIFI: items = &_wifiMenuItems; break;
        case CREDENTIALS: items = &_credentialsMenuItems; break;
        default: items = &_mainMenuItems; break;
    }
    
    if (selection <= static_cast<int>(items->size())) {
        const auto& item = (*items)[selection - 1];
        if (item.isEnabled && item.action) {
            item.action();
        }
    } else {
        _serial->println("Invalid selection");
        delay(500);
        showMenu(_currentMenu);
    }
}

void MenuSystem::exitMenu() {
    _inMenuMode = false;
    _serial->println("\nExited menu mode. Type 'menu' to return or 'help' for commands.");
}

void MenuSystem::setTimeout(unsigned long timeoutMs) {
    _menuTimeout = timeoutMs;
}

void MenuSystem::scanNetworks() {
    clearScreen();
    showHeader("WiFi Network Scan");
    
    std::vector<WiFiScanResult> results;
    if (_wifiManager->scanNetworks(results)) {
        _serial->println("Available networks:");
        _serial->println("================================");
        for (size_t i = 0; i < results.size(); i++) {
            _serial->printf("%d. %-20s RSSI: %-4d %s\n", 
                          i + 1, results[i].ssid.c_str(), results[i].rssi,
                          results[i].isOpen() ? "[OPEN]" : "[SECURED]");
        }
        _serial->println("================================");
        
        if (results.size() > 0) {
            int selection = getNumericInput("\nSelect network to connect to (0 to cancel)", 0, results.size());
            if (selection > 0 && selection <= static_cast<int>(results.size())) {
                connectToNetwork(results[selection - 1].ssid);
            }
        }
    } else {
        _serial->println("Scan failed. Please try again.");
    }
    
    delay(1000);
    showMenu(WIFI);
}

void MenuSystem::connectToNetwork(const String& presetSSID) {
    clearScreen();
    showHeader("Connect to WiFi Network");
    
    String ssid = presetSSID;
    if (ssid.isEmpty()) {
        ssid = getUserInput("Enter WiFi SSID (or 0 to cancel)");
        if (ssid == "0") {
            showMenu(WIFI);
            return;
        }
    }
    
    // Check if we have saved credentials for this SSID
    NetworkCredential savedCredential;
    if (_wifiManager->isStorageInitialized() && _wifiManager->listStoredCredentials().size() > 0) {
        for (const auto& cred : _wifiManager->listStoredCredentials()) {
            if (cred.getSSID() == ssid) {
                savedCredential = cred;
                break;
            }
        }
    }
    
    String password;
    
    if (!savedCredential.ssid[0]) {
        password = getUserInput("Enter WiFi password (leave blank for open network)", true);
    } else {
        _serial->printf("\nFound saved credentials for %s\n", ssid.c_str());
        _serial->printf("Connection stats: %lu attempts, %lu successful\n", 
                       savedCredential.connectionAttempts, savedCredential.successfulConnections);
        String useSaved = getUserInput("Use saved password? (y/n) [y]", false);
        if (useSaved.isEmpty() || useSaved.equalsIgnoreCase("y")) {
            password = savedCredential.getPassword();
            _serial->println("Using saved password...");
        } else {
            password = getUserInput("Enter WiFi password (leave blank for open network)", true);
        }
    }
    
    _serial->printf("\nConnecting to %s...\n", ssid.c_str());
    
    // Only save credentials if connection succeeds
    if (_wifiManager->connect(ssid, password, true)) {
        _serial->println("✓ Connection successful!");
    } else {
        _serial->println("✗ Connection failed!");
    }
    
    delay(2000);
    showMenu(WIFI);
}

void MenuSystem::checkConnection() {
    clearScreen();
    showHeader("WiFi Connection Status");
    
    auto status = _wifiManager->getStatus();
    
    if (status.connected) {
        _serial->println("✓ Currently connected to WiFi");
        _serial->printf("Network: %s\n", status.ssid.c_str());
        _serial->printf("IP Address: %s\n", status.ip.c_str());
        _serial->printf("Signal Strength: %d dBm\n", status.rssi);
    } else {
        _serial->println("✗ Not connected to WiFi");
        auto networks = _wifiManager->listStoredCredentials();
        if (!networks.empty()) {
            _serial->printf("Stored networks: %d\n", networks.size());
            for (const auto& net : networks) {
                _serial->printf("- %s (%lu successful)\n", net.getSSID().c_str(), net.successfulConnections);
            }
        } else {
            _serial->println("No saved WiFi credentials");
        }
    }
    
    delay(2000);
    showMenu(WIFI);
}

void MenuSystem::listStoredCredentials() {
    clearScreen();
    showHeader("Stored WiFi Credentials");
    
    auto networks = _wifiManager->listStoredCredentials();
    
    if (networks.empty()) {
        _serial->println("No stored WiFi credentials found");
    } else {
        _serial->printf("Found %d stored networks:\n", networks.size());
        _serial->println("================================");
        
        for (size_t i = 0; i < networks.size(); i++) {
            const auto& net = networks[i];
            _serial->printf("%d. SSID: %s\n", i + 1, net.getSSID().c_str());
            _serial->printf("   Attempts: %lu, Successful: %lu\n", 
                          net.connectionAttempts, net.successfulConnections);
            _serial->printf("   Last connected: %lu ms ago\n", 
                          millis() - net.lastConnected);
            _serial->println("--------------------------------");
        }
    }
    
