voltvirtuoso/SerialInterfaceHandler/src/ESP8266_SIH.cpp
    delay(3000);
    showMenu(CREDENTIALS);
}

void MenuSystem::removeStoredCredential() {
    clearScreen();
    showHeader("Remove Stored Network");
    
    auto networks = _wifiManager->listStoredCredentials();
    
    if (networks.empty()) {
        _serial->println("No stored credentials to remove");
        delay(1500);
        showMenu(CREDENTIALS);
        return;
    }
    
    _serial->println("Available networks to remove:");
    for (size_t i = 0; i < networks.size(); i++) {
        _serial->printf("%d. %s\n", i + 1, networks[i].getSSID().c_str());
    }
    
    int selection = getNumericInput("\nSelect network to remove (0 to cancel)", 0, networks.size());
    if (selection > 0 && selection <= static_cast<int>(networks.size())) {
        String ssid = networks[selection - 1].getSSID();
        String confirm = getUserInput("Confirm removal of '" + ssid + "'? (y/n)");
        if (confirm.equalsIgnoreCase("y")) {
            if (_wifiManager->removeCredential(ssid)) {
                _serial->println("✓ Network removed successfully");
            } else {
                _serial->println("✗ Failed to remove network");
            }
        } else {
            _serial->println("Operation cancelled");
        }
    }
    
    delay(1500);
    showMenu(CREDENTIALS);
}

void MenuSystem::clearAllCredentials() {
    clearScreen();
    showHeader("Clear All Credentials");
    
    _serial->println("This will remove ALL stored WiFi credentials from EEPROM.");
    _serial->println("You will need to reconfigure WiFi after clearing.");
    
    String confirm = getUserInput("Are you sure? (y/n)");
    if (confirm.equalsIgnoreCase("y")) {
        if (_wifiManager->clearAllCredentials()) {
            _serial->println("✓ All WiFi credentials cleared successfully");
        } else {
            _serial->println("✗ Failed to clear credentials");
        }
    } else {
        _serial->println("Operation cancelled");
    }
    
    delay(1500);
    showMenu(CREDENTIALS);
}

void MenuSystem::showSystemStatus() {
    clearScreen();
    showHeader("System Status");
    
    _serial->printf("System Uptime: %lu seconds\n", millis() / 1000);
    _serial->printf("Free Heap: %u bytes\n", ESP.getFreeHeap());
    _serial->printf("Chip Model: ESP8266\n");
    _serial->printf("EEPROM Size: %d bytes\n", EEPROM_SIZE);
	_serial->print("MAC Address: ");
	_serial->println(WiFi.macAddress());
    
    auto wifiStatus = _wifiManager->getStatus();
    _serial->printf("\nWiFi Status: %s\n", wifiStatus.connected ? "Connected" : "Disconnected");
    if (wifiStatus.connected) {
        _serial->printf("Connected to: %s\n", wifiStatus.ssid.c_str());
        _serial->printf("IP Address: %s\n", wifiStatus.ip.c_str());
        _serial->printf("Signal Strength: %d dBm\n", wifiStatus.rssi);
    }
    
    auto networks = _wifiManager->listStoredCredentials();
    _serial->printf("\nStored Networks: %d\n", networks.size());
    
    delay(3000);
    showMenu(MAIN);
}

String MenuSystem::getUserInput(const String& prompt, bool isSensitive) {
    _serial->println("\n" + prompt);
    _serial->print("> ");
    
    String input;
    unsigned long lastInput = millis();
    
    while (true) {
        if (_serial->available()) {
            char c = _serial->read();
            if (c == '\n' || c == '\r') {
                if (input.length() > 0) {
                    _serial->println();
                    return input;
                }
            } else if (c == 8 || c == 127) { // Backspace
                if (input.length() > 0) {
                    input.remove(input.length() - 1);
                    _serial->print("\b \b");
                    lastInput = millis();
                }
            } else if (c >= 32 && c <= 126) { // Printable characters
                input += c;
                if (isSensitive) {
                    _serial->print('*');
                } else {
                    _serial->print(c);
                }
                lastInput = millis();
            }
        }
        
        if (millis() - lastInput > 30000) { // 30 second timeout
            _serial->println("\nInput timeout");
            return "";
        }
        
        delay(10);
    }
}

int MenuSystem::getNumericInput(const String& prompt, int minVal, int maxVal) {
    while (true) {
        String input = getUserInput(prompt);
        if (input.isEmpty()) continue;
        
        int value = input.toInt();
        if (value == 0 && input != "0") {
            _serial->println("Invalid number. Please enter a valid number.");
            continue;
        }
        
        if (value < minVal || value > maxVal) {
            _serial->printf("Value must be between %d and %d\n", minVal, maxVal);
            continue;
        }
        
        return value;
    }
}

/*void MenuSystem::clearScreen() {
    _serial->print("\033[H\033[J");
    delay(50);
}*/

void MenuSystem::clearScreen() {
	for(uint8_t i=0; i < 5; i++)
		_serial->println();
}

void MenuSystem::showHeader(const String& title) {
    _serial->println("================================");
    _serial->printf("  %s\n", title.c_str());
    _serial->println("================================");
}

void MenuSystem::showFooter() {
    _serial->println("================================");
    _serial->printf("  Timeout: %lu seconds\n", (_menuTimeout - (millis() - _lastActivity)) / 1000);
    _serial->println("  Press '0' to exit menu");
    _serial->println("================================");
}

String MenuSystem::getMenuTitle(MenuType type) const {
    switch (type) {
        case MAIN: return "Main Menu";
        case WIFI: return "WiFi Configuration";
        case SYSTEM: return "System Management";
        case CREDENTIALS: return "Credentials Management";
        default: return "Menu";
    }
}

bool MenuSystem::isInMenu() const {
    return _inMenuMode;
}

// ESP8266_SIH Implementation
ESP8266_SIH::ESP8266_SIH(HardwareSerial* serial)
    : _serial(serial), _helpSystem(&_commandHandler, serial),
      _menuSystem(serial, &_commandHandler, &_wifiManager),
      _lastActivity(0), _timeout(30000), _initialized(false),
      _lastReconnectCheck(0), _lastWatchdogCheck(0) {}

bool ESP8266_SIH::begin(uint32_t baudRate) {
    _serial->begin(baudRate);
    delay(100);
    
    if (!_wifiManager.begin()) {
        _serial->println("WiFiManager initialization failed");
        return false;
    }
    
    // Attempt auto-reconnect immediately after initialization
    autoReconnectWiFi();
    
    // Register default commands
    registerCommand("help", [this](const std::vector<String>& args) {
        if (args.size() > 0) {
            _helpSystem.showHelp(args[0]);
        } else {
            _helpSystem.showHelp();
        }
    }, "Show help information", "help [command]", "system");
    
    registerCommand("?", [this](const std::vector<String>& args) {
        _helpSystem.showQuickHelp();
    }, "Show quick help summary", "?", "system");
    
    registerCommand("menu", [this](const std::vector<String>& args) {
        _menuSystem.showMenu(MenuSystem::MAIN);
    }, "Show main menu", "menu", "system");
    
    registerCommand("status", [this](const std::vector<String>& args) {
        auto wifiStatus = _wifiManager.getStatus();
        _serial->printf("System Uptime: %lu seconds\n", millis() / 1000);
        _serial->printf("Free Heap: %u bytes\n", ESP.getFreeHeap());
        _serial->printf("WiFi Status: %s\n", wifiStatus.connected ? "Connected" : "Disconnected");
		_serial->print("MAC Address: ");
		_serial->println(WiFi.macAddress());
        if (wifiStatus.connected) {
            _serial->printf("Connected to: %s\n", wifiStatus.ssid.c_str());
            _serial->printf("IP Address: %s\n", wifiStatus.ip.c_str());
            _serial->printf("Signal Strength: %d dBm\n", wifiStatus.rssi);
        }
        
        auto networks = _wifiManager.listStoredCredentials();
        _serial->printf("\nStored Networks: %d\n", networks.size());
        for (const auto& net : networks) {
            _serial->printf("- %s (Success: %lu)\n", net.getSSID().c_str(), net.successfulConnections);
        }
    }, "Show system status", "status", "system");
    
    registerCommand("wifi", [this](const std::vector<String>& args) {
        if (args.size() > 0) {
            if (args[0] == "scan") {
                std::vector<WiFiScanResult> results;
                if (_wifiManager.scanNetworks(results)) {
                    _serial->println("Available networks:");
                    for (size_t i = 0; i < results.size(); i++) {
                        _serial->printf("%d. %s (RSSI: %d, %s)\n", i + 1, 
                                      results[i].ssid.c_str(), results[i].rssi,
                                      results[i].isOpen() ? "Open" : "Secured");
                    }
                } else {
                    _serial->println("Scan failed");
                }
            } else if (args[0] == "connect" && args.size() > 1) {
                String ssid = args[1];
                String password = (args.size() > 2) ? args[2] : "";
                if (_wifiManager.connect(ssid, password, true)) {
                    _serial->println("Connected successfully");
                } else {
                    _serial->println("Connection failed");
                }
            } else if (args[0] == "status") {
                auto status = _wifiManager.getStatus();
                _serial->printf("WiFi Status: %s\n", status.connected ? "Connected" : "Disconnected");
                if (status.connected) {
                    _serial->printf("Connected to: %s\n", status.ssid.c_str());
                    _serial->printf("IP: %s\n", status.ip.c_str());
                }
            } else if (args[0] == "auto") {
                if (_wifiManager.autoConnect()) {
                    _serial->println("Auto-connect successful");
                } else {
                    _serial->println("Auto-connect failed");
                }
            }
        } else {
            _serial->println("WiFi commands: scan, connect <ssid> <password>, status, auto");
        }
    }, "WiFi management commands", "wifi <command>", "wifi");
    
