voltvirtuoso/SerialInterfaceHandler/src/ESP8266_SIH.cpp
    registerCommand("creds", [this](const std::vector<String>& args) {
        if (args.size() > 0) {
            if (args[0] == "list") {
                auto networks = _wifiManager.listStoredCredentials();
                if (networks.empty()) {
                    _serial->println("No stored credentials");
                } else {
                    _serial->printf("Stored networks (%d):\n", networks.size());
                    for (size_t i = 0; i < networks.size(); i++) {
                        const auto& net = networks[i];
                        _serial->printf("%d. %s\n", i + 1, net.getSSID().c_str());
                        _serial->printf("   Success: %lu, Attempts: %lu\n", 
                                      net.successfulConnections, net.connectionAttempts);
                    }
                }
            } else if (args[0] == "remove" && args.size() > 1) {
                if (_wifiManager.removeCredential(args[1])) {
                    _serial->println("✓ Network removed");
                } else {
                    _serial->println("✗ Network not found");
                }
            } else if (args[0] == "clear") {
                if (_wifiManager.clearAllCredentials()) {
                    _serial->println("✓ All credentials cleared");
                }
            }
        } else {
            _serial->println("Credentials commands: list, remove <ssid>, clear");
        }
    }, "Manage stored credentials", "creds <command>", "wifi");
    
    registerCommand("reconnect", [this](const std::vector<String>& args) {
        _serial->println("Attempting to reconnect to stored networks...");
        autoReconnectWiFi();
        auto status = _wifiManager.getStatus();
        if (status.connected) {
            _serial->printf("✓ Reconnected to %s\n", status.ssid.c_str());
            _serial->printf("IP: %s\n", status.ip.c_str());
        } else {
            _serial->println("✗ Reconnection failed");
            _serial->println("Type 'menu' to configure WiFi manually");
        }
    }, "Reconnect to stored networks", "reconnect", "system");
    
    _initialized = true;
    _lastActivity = millis();
    _lastReconnectCheck = millis();
    _lastWatchdogCheck = millis();
    
    _serial->println("\nESP8266 Serial Interface System initialized");
    _serial->println("Type 'help' for available commands");
    _serial->println("Type 'menu' to access configuration menu");
    
    // Show connection status after initialization
    auto status = _wifiManager.getStatus();
    if (status.connected) {
        _serial->printf("\n✓ Connected to: %s\n", status.ssid.c_str());
        _serial->printf("IP Address: %s\n", status.ip.c_str());
    } else {
        _serial->println("\n✗ No active WiFi connection");
        _serial->println("Type 'menu' to configure WiFi");
        _serial->printf("Stored networks: %d\n", _wifiManager.listStoredCredentials().size());
    }
    
    return true;
}

void ESP8266_SIH::autoReconnectWiFi() {
    auto status = _wifiManager.getStatus();
    
    // Only attempt reconnection if not currently connected
    if (!status.connected) {
        Serial.println("Attempting auto-reconnection...");
        bool success = _wifiManager.autoConnect();
        
        if (success) {
            status = _wifiManager.getStatus();
            Serial.printf("✓ Auto-reconnection successful to: %s\n", status.ssid.c_str());
            Serial.printf("IP: %s\n", status.ip.c_str());
        } else {
            Serial.println("✗ Auto-reconnection failed");
        }
    }
}

void ESP8266_SIH::process() {
    if (!_initialized) return;
    
    // Periodically check and attempt reconnection if disconnected
    if (millis() - _lastReconnectCheck > 30000) { // Check every 30 seconds
        _lastReconnectCheck = millis();
        auto status = _wifiManager.getStatus();
        if (!status.connected) {
            Serial.println("Connection lost, attempting reconnection...");
            autoReconnectWiFi();
        }
    }
    
    // Watchdog protection - ensure WiFi stays connected
    if (millis() - _lastWatchdogCheck > 60000) { // Every 60 seconds
        _lastWatchdogCheck = millis();
        auto status = _wifiManager.getStatus();
        if (!status.connected) {
            Serial.println("Watchdog: Connection lost, forcing reconnection...");
            autoReconnectWiFi();
        }
    }
    
    if (_serial->available()) {
        static String inputLine;
        while (_serial->available()) {
            char c = _serial->read();
            if (c == '\n' || c == '\r') {
                if (inputLine.length() > 0) {
                    _lastActivity = millis();
                    
                    if (_menuSystem.isInMenu() && inputLine.length() == 1) {
                        _menuSystem.handleMenuInput(inputLine[0]);
                    } else {
                        _commandHandler.executeCommand(inputLine);
                    }
                    
                    inputLine = "";
                }
            } else if (c == 8 || c == 127) { // Backspace
                if (inputLine.length() > 0) {
                    inputLine.remove(inputLine.length() - 1);
                    _serial->print("\b \b");
                }
            } else if (c >= 32 && c <= 126) { // Printable characters
                inputLine += c;
                _serial->print(c);
            }
        }
    }
    
    _menuSystem.process();
    
    if (millis() - _lastActivity > _timeout && _menuSystem.isInMenu()) {
        _menuSystem.exitMenu();
        _serial->println("\nInactivity timeout. Returned to command mode.");
    }
}

void ESP8266_SIH::registerCommand(const String& command, 
                             CommandHandler::CommandCallback handler,
                             const String& description,
                             const String& usage,
                             const String& category) {
    _commandHandler.registerCommand(command, handler, description, usage, category);
}

void ESP8266_SIH::setTimeout(unsigned long timeoutMs) {
    _timeout = timeoutMs;
    _menuSystem.setTimeout(timeoutMs);
}

bool ESP8266_SIH::isConnected() const {
    auto status = _wifiManager.getStatus();
    return status.connected;
}

String ESP8266_SIH::getConnectedSSID() const {
    auto status = _wifiManager.getStatus();
    return status.ssid;
}